/*
 * 516.    *Пять подряд по диагонали.  Определите, существует ли в двумерном массиве размером 10 на 10 пять подряд идущих единиц в одной из диагоналей. Примеры
 *
 * Входные данные
 *
 * int mas[N][N]= {
 *   {0,0,0,0,1,0,0,0,0,0},
 *   {0,0,0,1,0,0,0,0,0,0},
 *   {0,0,1,0,0,0,0,0,0,0},
 *   {0,1,0,0,0,0,0,0,0,0},
 *   {1,0,0,0,0,0,0,0,0,0},
 *   {0,0,0,0,0,0,0,0,0,0},
 *   {0,0,0,0,0,0,0,0,0,0},
 *   {0,0,0,0,0,0,0,0,0,0},
 *   {0,0,0,0,0,0,0,0,0,0},
 *   {0,0,0,0,0,0,0,0,0,0}
 * };
 * Выходные данные 1
 *
 * Входные данные
 *
 * int mas[N][N]= {
 *   {0,0,0,0,0,0,0,0,0,0},
 *   {0,0,0,0,0,0,0,0,0,0},
 *   {0,0,0,0,0,0,0,0,0,0},
 *   {0,0,0,0,0,0,0,0,0,0},
 *   {0,0,0,0,0,0,0,0,0,0},
 *   {0,0,0,0,0,0,0,0,0,1},
 *   {0,0,0,0,0,0,0,0,1,0},
 *   {0,0,0,0,0,0,0,1,0,0},
 *   {0,0,0,0,0,0,1,0,0,0},
 *   {0,0,0,0,0,1,0,0,0,0}
 * };
 * Выходные данные 1
 *
 * */

#include <iostream>

using namespace std;

int main() {
    return 0;
}
