/*
 * 517.    *Спираль.
 * Заполните двумерный массив целых чисел размером N на N так,
 * как представлено в примерах и выведите его на экран.
 * При выводе элементов массива на экран выровните их по правому краю.
 * Используйте массив с границами, это может помочь упростить составление алгоритма.
 *
 * Примеры
 * N = 3
 * 1 2 3
 * 8 9 4
 * 7 6 5
 *
 * N = 4
 * 1   2  3  4
 * 12 13 14  5
 * 11 16 15  6
 * 10  9  8  7
 *
 * */

#include <iostream>

using namespace std;

int main() {
    return 0;
}
