/*
 * 455.    *Самое длинное слово.
 *
 * Дано предложение.
 * Cлова в нём разделены одним или несколькими пробелами.
 * В предложении могут присутствовать начальные и конечные пробелы.
 * Найти длину самого длинного слова в этом тексте.
 * Оформите программу в функцию maxLengthWord.
 *
 * Примеры
 * входные данные "abcd    abc"   - выходные данные – 4
 * входные данные "  abcd    abc" - выходные данные – 4
 * входные данные " cd    abc"    - выходные данные – 3
 * входные данные " cd    abc  "  - выходные данные – 3
 *
 * */

#include <iostream>

using namespace std;

int main() {
    return 0;
}
